In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [7]:
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [9]:
date['date_year'] = date['date'].dt.year

In [10]:
date['date_month'] = date['date'].dt.month

In [11]:
date['date_month_name'] = date['date'].dt.month_name()

In [12]:
date['date_days'] = date['date'].dt.day

In [13]:
date['date_dow_name'] = date['date'].dt.day_name()

In [14]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']), 1,0)

In [15]:
date['week_of_year'] = date['date'].dt.week

/var/folders/k5/m5y73k4n41d0_vmt2kk4st180000gn/T/ipykernel_71463/1488491725.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['week_of_year'] = date['date'].dt.week

In [16]:
date['quarter'] = date['date'].dt.quarter

In [17]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1,2)

In [18]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_dow_name,date_is_weekend,week_of_year,quarter,semester
419,2018-08-22,7430,1,1,2018,8,August,22,Wednesday,0,34,3,2
760,2019-10-31,6215,22,7,2019,10,October,31,Thursday,0,44,4,2
628,2019-08-03,5823,27,1,2019,8,August,3,Saturday,1,31,3,2
357,2019-02-09,532,18,1,2019,2,February,9,Saturday,1,6,1,1
675,2018-12-05,4038,27,1,2018,12,December,5,Wednesday,0,49,4,2

In [21]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2022, 11, 24, 19, 48, 58, 797995)

In [22]:
today - date['date']

0     1080 days 19:48:58.797995
1     1562 days 19:48:58.797995
2     1493 days 19:48:58.797995
3     1195 days 19:48:58.797995
4     1418 days 19:48:58.797995
                 ...
995   1508 days 19:48:58.797995
996   1449 days 19:48:58.797995
997   1297 days 19:48:58.797995
998   1362 days 19:48:58.797995
999   1136 days 19:48:58.797995
Name: date, Length: 1000, dtype: timedelta64[ns]

In [24]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [30]:
time['date']= pd.to_datetime(time['date'])

In [33]:
time['hour'] = time['date'].dt.hour

In [35]:
time['min'] = time['date'].dt.minute

In [38]:
time['second'] = time['date'].dt.second

In [41]:
time['time'] = time['date'].dt.time

In [42]:
time.head()

,date,msg,hour,min,second,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [43]:
today - time['date']

0     3266 days 18:58:58.797995
1     3130 days 20:08:58.797995
2     3616 days 19:27:58.797995
3     2918 days 19:17:58.797995
4     3315 days 20:37:58.797995
                 ...
995   3905 days 18:58:58.797995
996   3226 days 20:34:58.797995
997   3691 days 20:11:58.797995
998   3807 days 20:14:58.797995
999   3079 days 20:23:58.797995
Name: date, Length: 1000, dtype: timedelta64[ns]